<?php
return [
    'log_status' => [
        1 => '已领去/审核同意',
        2 => '未领取',
        3 => '审核-拒绝',
        4 => '次日发放失败',
        5 => '客服拒绝发放',
        6 => '锁住',
        7 => '管理员-拒绝',
    ],

    'check' => [
        1 => '需要审核',
        2 => '不需要审核',
    ],

    // 领取方式
    'obtain_type' => [
        ['key' => 1, 'name' => '及时领取'],
        ['key' => 2, 'name' => '第二天赠送'],
        ['key' => 3, 'name' => '客服领取'],
        ['key' => 4, 'name' => '待领取'],
    ],

    // 领取类型
    'status' => [
        ['key' => 1, 'name' => '已领去/审核同意'],
        ['key' => 2, 'name' => '未领取'],
        ['key' => 3, 'name' => '审核-拒绝'],
        ['key' => 4, 'name' => '次日发放失败'],
        ['key' => 5, 'name' => '客服拒绝发放'],
        ['key' => 6, 'name' => '锁住'],
        ['key' => 7, 'name' => '管理员-拒绝'],
    ]
];