<?php

return [
    "methods" => [
        // 五星
        "ZX5"       => 68,  // 直选5
        "ZH5"       => 15,  // 组合5
        "WXZU120"   => 32,  // 组120
        "WXZU60"    => 31,  // 组60
        "WXZU30"    => 30,  // 组30
        "WXZU20"    => 29,  // 组20
        "WXZU10"    => 28,  // 组10
        "WXZU5"     => 27,  // 组5

        // 四星
        "ZX4"       => 67,  // 四星直选复式
        "ZH4"       => 79,  // 四星直选组合
        "SXZU24"    => 26,  // 四星组选24
        "SXZU12"    => 25,  // 四星组选12
        "SXZU6"     => 24,  // 四星组选6
        "SXZU4"     => 23,  // 四星组选4

        // 前 三星
        "QZX3"      => 65, // 前三直选复式
        "QZH3"      => 14, // 前三直选组合
        "QZXHZ"     => 71, // 前三直选和值
        "QZXKD"     => 60, // 前三直选跨度
        "QZU3"      => 16, // 前三组三复式
        "QZU6"      => 17, // 前三组六复式
        "QZUHZ"     => 75, // 前三组选和值
        "QZU3BD"    => 64, // 前三组选包胆
        "QHZWS"     => 33, // 前三和尾
        "QTS3"      => 48, // 前三特殊

        // 中 三星
        "ZZX3"      => 142, // 中三直选复式
        "ZZH3"      => 148, // 中三直选组合
        "ZZXHZ"     => 145, // 中三直选和值
        "ZZXKD"     => 147, // 中三直选跨度
        "ZZU3"      => 150, // 中三组三复式
        "ZZU6"      => 152, // 中三组六复式
        "ZZUHZ"     => 160, // 中三组选和值
        "ZZU3BD"    => 153, // 中三组选包胆
        "ZHZWS"     => 149, // 中三和尾
        "ZTS3"      => 151, // 中三特殊

        // 后 三星
        "HZX3"      => 69, // 后三直选复式
        "HZH3"      => 82, // 后三直选组合
        "HZXHZ"     => 73, // 后三直选和值
        "HZXKD"     => 62, // 后三直选跨度

        "HZU3"                  => 49, // 后三组三复式
        "HZU6"                  => 50, // 后三组六复式
        "HZUHZ"                 => 80, // 后三组选和值
        "HZU3BD"                => 83, // 后三组选包胆
        "HHZWS"                 => 54, // 后三和尾
        "HTS3"                  => 57, // 后三特殊

        // 前 二星
        "QZX2"                  => 66, // 前二直选复式
        "QZX2HZ"                => 72, // 前二直选和值
        "QZX2KD"                => 61, // 前二直选跨度
        "QZU2"                  => 20, // 前二组选复式
        "QZU2HZ"                => 76, // 前二组选和值
        "QZU2BD"                => 84, // 前二组选包胆

        // 后 二星
        "HZX2"                  => 70, // 后二直选复式
        "HZX2HZ"                => 74, // 后二直选和值
        "HZX2KD"                => 63, // 后二直选跨度
        "HZU2"                  => 59, // 后二组选复式
        "HZU2HZ"                => 77, // 后二组选和值
        "HZU2BD"                => 85, // 后二组选包胆

        "DWD_W"                 => 78, // 定位胆 万
        "DWD_Q"                 => 78, // 定位胆 千
        "DWD_B"                 => 78, // 定位胆 百
        "DWD_S"                 => 78, // 定位胆 十
        "DWD_G"                 => 78, // 定位胆 个

        "CO_ZX_W_DXDS"          => 78, // 大小单双 万
        "CO_ZX_Q_DXDS"          => 78, // 大小单双 千
        "CO_ZX_B_DXDS"          => 78, // 大小单双 百
        "CO_ZX_S_DXDS"          => 78, // 大小单双 十
        "CO_ZX_G_DXDS"          => 78, // 大小单双 个


        "CO_ZX_W"               => 78, // 娱乐城 万
        "CO_ZX_Q"               => 78, // 娱乐城 千
        "CO_ZX_B"               => 78, // 娱乐城 百
        "CO_ZX_S"               => 78, // 娱乐城 十
        "CO_ZX_G"               => 78, // 娱乐城 个

        "CO_ZHDXDS"             => 500, // 总和大小单双

        "CO_QWZY"               => 501, // 全5中1

        "CO_LHWQ"               => 220,     // 娱乐城 龙虎万千
        "CO_LHWB"               => 221,     // 娱乐城 龙虎万百
        "CO_LHWS"               => 222,     // 娱乐城 龙虎万十
        "CO_LHWG"               => 223,     // 娱乐城 龙虎万个

        "CO_LHQB"               => 224,     // 娱乐城 龙虎千百
        "CO_LHQS"               => 225,     // 娱乐城 龙虎千十
        "CO_LHQG"               => 226,     // 娱乐城 龙虎千个

        "CO_LHBS"               => 227,     // 娱乐城 龙虎百十
        "CO_LHBG"               => 228,     // 娱乐城 龙虎百个
        "CO_LHSG"               => 229,     // 娱乐城 龙虎十个

        // 不定位
        "HBDW31"                => 51,  // 后三一码不定位
        "HBDW32"                => 52,  // 后三二码不定位
        "QBDW31"                => 18,  // 前三一码不定位
        "QBDW32"                => 21,  // 前三二码不定位
        "ZBDW31"                => 155, // 中三一码不定位
        "ZBDW32"                => 156, // 中三二码不定位
        "BDW41"                 => 34,  // 四星一码不定位
        "BDW42"                 => 35,  // 四星二码不定位
        "BDW52"                 => 36,  // 五星二码不定位
        "BDW53"                 => 37,  // 五星三码不定位

        // 大小单双
        "Q3DXDS"        => 22,  // 前三大小单双
        "Q2DXDS"        => 19,  // 前二大小单双
        "H3DXDS"        => 53,  // 后三大小单双
        "H2DXDS"        => 58,  // 后二大小单双

        // 趣味
        "YFFS"          => 44,  // 一帆风顺
        "HSCS"          => 45,  // 好事成双
        "SXBX"          => 46,  // 三星报喜
        "SJFC"          => 47,  // 四季发财

        // 趣味
        "ZX5_S"         => 7,  // 五星直选单式
        "ZX4_S"         => 6,  // 四星直选单式

        "QZX3_S"        => 1,  // 前三直选单式
        "QHHZX"         => 13,  // 前三混合组选
        "QZU3_S"        => 2,  // 前三组三单式
        "QZU6_S"        => 3,  // 前三组六单式

        "ZZX3_S"        => 143,  // 中三直选单式
        "ZHHZX"         => 153,  // 中三混合组选
        "ZZU3_S"        => 144,  // 中三组三单式
        "ZZU6_S"        => 146,  // 中三组六单式

        "HZX3_S"        => 8,   // 后三直选单式
        "HHHZX"         => 81,  // 后三混合组选
        "HZU3_S"        => 9,   // 后三组三单式
        "HZU6_S"        => 10,  // 后三组六单式

        "QZX2_S"        => 4,   // 前二直选单式
        "QZU2_S"        => 5,   // 前二组选单式
        "HZX2_S"        => 11,  // 后二直选单式
        "HZU2_S"        => 12,  // 后二组选单式

        "LHWQ"          => 220,   // 龙虎万千
        "LHWB"          => 221,   // 龙虎万千
        "LHWS"          => 222,  // 龙虎万千
        "LHWG"          => 223,  // 龙虎万千

        "LHQB"          => 224,   // 龙虎万千
        "LHQS"          => 225,  // 龙虎万千
        "LHQG"          => 226,  // 龙虎万千

        "LHBS"          => 227,   // 龙虎万千
        "LHBG"          => 228,   // 龙虎万千
        "LHSG"          => 229,  // 龙虎万千
    ],
];
