<?php

// 银行类型
return [
    'icbc'      => "中国工商银行",
    'abc'       => "中国农业银行",
    'cmb'       => "中国招商银行",
    'boc'       => "中国银行",
    'ccb'       => "中国建设银行",
    'cmbc'      => "中国民生银行",
    'ecitic'    => "中信银行",
    'comm'      => "中国交通银行",
    'cib'       => "中国兴业银行",
    'ceb'       => "中国光大银行",
    'szfz'      => "深圳发展银行",
    'psbc'      => "中国邮政储蓄银行",
    'bccb'      => "北京银行",
    'payh'      => "平安银行",
    'spdb'      => "上海浦东发展银行",
    'gdb'       => "深圳发展银行",
    'cgb'       => "广东发展银行",
    'hxb'       => "华夏银行",
    'pingan'    => "中国平安银行",
    'bos'       => "上海银行",
];
